[
    {
        "name": "American Staffordshire Terrier",
        "other_names": "Amstaff",
        "country_of_origin": "United States",
        "desription": "American Staffordshire Terrier is a medium-sized, short-coated dog breed.Elegant and agile. It is one of several breeds commonly known as pit bulls",
        "temperament": "people-oriented dog,loyal to his own family",
        "life_span": "9-15",
        "weight": "20-30",
        "height": "43-48",
        "litter_size": "4-8",
        "remarks": "agressive toward other dogs",
	"grp":"working",
	"size":"medium",
	"thumbnail":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/american-staffordshire-terrier-th.jpg",
	"image":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/american-staffordshire-terrier.jpg"
    },
    {
        "name": "Beagle",
        "other_names": "English Beagle",
        "country_of_origin": "England",
        "desription": "Beagles are hounds, developed primarily for tracking hare, rabbit, deer. They have a great sense of smell and tracking instinct that sees them employed as detection dogs for drugs around the world. Beagles are intelligent but single-minded, and popular pets because of their size, even temper, and lack of inherited health problems.",
        "temperament": "even temper and gentle,neither aggressive nor timid ",
        "life_span": "12–15",
        "weight": "10–11",
        "height": "33-41",
        "litter_size": "3-6",
        "remarks": "hard to train",
	"grp":"hound",
	"size":"small",
	"thumbnail":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/beagle-puppy-th.jpg",
	"image":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/beagle.jpg"
    },
    {
        "name": "Bernese Mountain Dog",
        "other_names": "Berner Sennenhund,Bernese Cattle Dog",
        "country_of_origin": "Switzerland",
        "desription": "The Bernese Mountain Dog is a large-sized breed of dog, one of the four breeds of Sennenhund-type dogs from the Swiss Alps. Bernese  refers to the area of the breed’s origin, in the canton of Bern in Switzerland. This mountain dog was originally kept as a general farm dog. Large dogs in the past were also used as draft animals, pulling carts.",
        "temperament": "good-natured, outdoor dogs at heart,though well-behaved in the house; they need activity and exercise",
        "life_span": "7-8",
        "weight": "35–55",
        "height": "58-70",
        "litter_size": "4-10",
        "remarks": "easy to train",
	"grp":"working",
	"size":"large",
	"thumbnail":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/bernese-mountain-dog-th.jpg",
	"image":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/bernese-mountain.jpg"
    },
    {
        "name": "Bulldog",
        "other_names": "British Bulldog,English Bulldog",
        "country_of_origin": "United Kingdom",
        "desription": "The Bulldog is a muscular,medium-sized  heavy dog with a wrinkled face and a distinctive pushed-in nose.There are generally thick folds of skin on a Bulldog's brow; a short muzzle  called a knot above the nose; hanging skin under the neck; drooping lips and pointed teeth, and occasionally an underbite. The coat is short, flat, and sleek, with colours of red, fawn, white. Bulldogs are one of the few breeds whose tail is naturally short.",
        "temperament": "getting along well with children, other dogs, and pets;excellent family pets because of  tendency to form strong bonds with children.",
        "life_span": "8–10",
        "weight": "18-25",
        "height": "30 - 40",
        "litter_size": "3-6",
        "remarks": "family friendly",
	"grp":"non-sporting",
	"size":"medium",
	"thumbnail":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/bulldog-th.jpg",
	"image":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/bulldog.jpg"
    },
    {
        "name": "Bull Terrier",
        "other_names": "Bully, Gladiator, English Bull Terrie",
        "country_of_origin": "England",
        "desription": "Bull Terrier breed belongs to terrier family. It's most recognizable feature is its head, described as 'egg-shaped' when viewed from the front.The under-jaw is deep and strong. The unique triangular eyes are small, dark, and deep-set. Bull terriers are the only dogs that have triangular eyes. The body is full and round, with strong, muscular shoulders. The tail is carried horizontally. They are generally white in colour.",
        "temperament": "protective of their family,although can be both independent and stubborn",
        "life_span": "10–15",
        "weight": "22–38",
        "height": "45–55",
        "litter_size": "1-9",
        "remarks": "family friendly",
	"grp":"terrier",
	"size":"medium",
	"thumbnail":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/bullterrier-th.jpg",
	"image":"https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/bullterrier.jpg"
    },
    {
        "name": "Cavalier King Charles Spaniel",
        "other_names": "Cav, Cavalier, Cavie",
        "country_of_origin": "United Kingdom",
        "desription": "The Cavalier King Charles Spaniel is one of the largest toy breeds. Historically it was a lap dog, and modern day adults can fill a lap easily. Nonetheless, it is small for a spaniel, with fully grown adults comparable in size to adolescents of other larger spaniel breeds.  The tail is usually not docked, the Cavalier should have a silky coat of moderate length. Standards state that it should be free from curl, although a slight wave is allowed. Feathering can grow on their ears, feet, legs and tail in adulthood. Standards require this be kept long, with the feathering on the feet a particularly important aspect of the breed's featuresIt has a silky, smooth coat and commonly a smooth undocked tail. The breed standard recognizes four colours: Blenheim (chestnut and white), Tricolor (black/white/tan), Black and Tan, and Ruby.The breed is generally friendly, affectionate and good with both children and other animals; however, they require a lot of human interaction.",
        "temperament": "The breed is highly affectionate, playful, extremely patient and eager to please. As such, dogs of the breed are good with children and other dogs",
        "life_span": "9-14 years",
        "weight": "5.9–8.2 kg",
        "height": "30–33 cm",
        "litter_size": "2-6",
        "remarks": "easy to train",
	"grp":"toy",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/cavalier_spaniel.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/cavalier_spaniel.jpg"
    },
    {
        "name": "Chihuahua",
        "other_names": "chi",
        "country_of_origin": "Mexico",
        "desription": "The smallest breed of dog and is named for the state of Chihuahua in Mexico. Chihuahuas come in a wide variety of sizes, head shapes, colors, and coat length. Chihuahuas come in virtually any color combination,allowing for colors from solid black to solid white, spotted, sabled, or a variety of other colors and patterns. Colors and patterns can combine and affect each other, resulting in a very high degree of variation. Common colors are fawn, red, cream, chocolate, brown, mixed, white, and black.The most common and most likely theory is that Chihuahuas are descended from the Techichi, a companion dog favored by the Toltec civilization in Mexico",
        "temperament": "Chihuahuas can be easily provoked to attack, and are therefore generally unsuitable for homes with small children.They do not always get along with other breeds and tend to have a clannish nature, often preferring the companionship of other Chihuahuas or Chihuahua mixes over other dogs.",
        "life_span": "12-20 years",
        "weight": "1.8–2.7 kg",
        "height": "15–25 cm",
        "litter_size": "2-5",
        "remarks": "agressive toward other dogs and animals",
	"grp":"toy",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/chihuahua-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/chihuahua.jpg"
    },
    {
        "name": "Dachshund",
        "other_names": "Dackel, Wiener Dog, Sausage Dog,",
        "country_of_origin": "Germany",
        "desription": "A typical dachshund is long-bodied and muscular, with short, stubby legs. Its front paws are unusually large and paddle-shaped, for extreme digging. Long coated dachshunds have a silky coat and short featherings on legs and ears. It has skin that is loose enough not to tear while tunneling in tight burrows to chase prey. The dachshund has a deep chest that provides increased lung capacity for stamina when hunting prey underground. Its snout is long with an increased nose area that absorbs odors.Dachshunds have a wide variety of colors and patterns. They can be single-colored, single-colored with spots, and single-colored with tan points plus any pattern. Dachshunds in the same litter may be born in different coat colors. There are three types of dachshund, which can be classified by their coats: short-haired, called 'smooth'; long-haired; and wire-haired.",
        "temperament": "playful, but as hunting dogs can be quite stubborn, and are known for their propensity for chasing small animals, birds, and tennis balls with great determination and ferocity",
        "life_span": "8-14",
        "weight": "4-15 kg",
        "height": "17-25 cm",
        "litter_size": "1-5",
        "remarks": "appropriate for apartments, symbol of Germany",
	"grp":"hound",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/dachshund-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/dachshund.jpg"
    },
    {
        "name": "Dalmatian",
        "other_names": "Dal, Carriage Dog",
        "country_of_origin": "Croatia",
        "desription": "The Dalmatian is a large breed of dog noted for its unique black or liver spotted coat and was mainly used as a carriage dog in its early days. Its roots trace back to Dalmatia, a region of modern-day Croatia.It's is a large, well-defined, muscular dog with excellent endurance and stamina.The body is as long from forechest to buttocks as it is tall at the withers, and the shoulders are laid back. The Dalmatian's feet are round with well-arched toes, and the nails are usually white or the same colour as the dog's spots. The thin ears taper towards the tip and are set fairly high and close to the head. Eye color varies between brown, amber, or blue, with some dogs having one blue eye and one brown eye, or other combinations.",
        "temperament": "The Dalmatian is often used as a rescue dog, guardian, athletic partner, most often an active family member, and can be used as a fire dog.",
        "life_span": "10-13 cm",
        "weight": "15–32 kg",
        "height": "56-61 cm",
        "litter_size": "6-9",
        "remarks": "Appropriate for flats, easy to train",
	"grp":"non-sporting",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/dalmatian-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/dalmatian.jpg"
    },
    {
        "name": "French Bulldog",
        "other_names": "Frenchie",
        "country_of_origin": "England",
        "desription": "The French Bulldog is a small breed of domestic dog.The French Bulldog is active, muscular dog, of heavy bone, smooth coat, compactly built, and of medium or small structure. The points are well distributed and bear good relation one to the other.The most common colors are brindle, then fawn, with pieds being less common than the other colors.These dogs need warm clothing when out in cold weather. Precautions must be taken when exercising during hot or humid weather, as they are prone to heat stroke. It is also recommended that French Bulldogs who live indoors have access to air conditioning to regulate their temperature, provided the air conditioning is not set too low.",
        "temperament": "calm nature makes them an excellent choice for apartment dwellers, as do their sensible attitude towards barking.",
        "life_span": "8-10 years",
        "weight": "8–12 kg",
        "height": "28-31 cm",
        "litter_size": "3-5",
        "remarks": "This breed is patient and affectionate with its owners, especially with children, who are especially protected by the females.",
	"grp":"non-sporting",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/french_buldog-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/french_buldog.jpg"
    },
    {
        "name": "German Shepherd",
        "other_names": "Alsatian,German Shepherd",
        "country_of_origin": "Germany",
        "desription": "The German Shepherd is a relatively new breed of dog, with their origin dating to 1899. As part of the Herding Group, German Shepherds are working dogs developed originally for herding sheep. Since that time, however, because of their strength, intelligence, trainability and obedience, German Shepherds around the world are often the preferred breed for many types of work, including assistance, search-and-rescue, police and military roles, and even acting.They have a domed forehead, a long square-cut muzzle and a black nose. The jaws are strong, with a scissor-like bite. The eyes are medium-sized and brown with a lively, intelligent and self-assured look. The ears are large and stand erect, open at the front and parallel, but they often are pulled back during movement. They have a long neck, which is raised when excited and lowered when moving at a fast pace. The tail is bushy and reaches to the hock.German Shepherds have a variety of colors, the most common of which are tan and black and red and black. Most color varieties have black masks and black body markings which can range from a classic saddle to an over-all blanket. Rarer colour variations include the sable, pure-black, pure-white, liver and blue varieties.",
        "temperament": "curious, which makes them excellent guard dogs and suitable for search missions;they can become over-protective of their family and territory, especially if not socialized correctly.",
        "life_span": "9–13 years",
        "weight": "22–40 kg",
        "height": "55–65 cm",
        "litter_size": "4-9",
        "remarks": "especially well known for their police work, being used for tracking criminals, patrolling troubled areas and  detection and holding of suspects",
	"grp":"herding",
	"size":"large",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/german-shepherd-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/german-shepherd.jpg"
    },
    {
        "name": "Golden Retriever",
        "other_names": "Yellow retriever",
        "country_of_origin": "Scotland",
        "desription": "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named retriever because of their ability to retrieve shot game undamaged.Golden Retrievers have an instinctive love of water, and are easy to train to basic or advanced obedience standards. They are a long-coated breed, with a dense inner coat that provides them with adequate warmth in the outdoors, and an outer coat that lies flat against their bodies and repels water.  Although they need substantial outdoor exercise, they should be housed in a fenced area because of their instinctual tendency to roam.As a dog with origins in pedigree breeding, and due to its widespread historical popularity, some regional variations have emerged in the breed; therefore, the three subtypes of the Golden Retriever reflect the typical variations in dimensions and coat. However, all Golden Retrievers are blonde, yellow, or gold in colour and all subtypes are susceptible to the same health problems.",
        "temperament": "very smart dogs that are loyal and friendly to their caregivers;kindly, and confident",
        "life_span": "10-12 years",
        "weight": "27-34 kg",
        "height": "55-61 cm",
        "litter_size": "4-8",
        "remarks": " well suited to residency in suburban or country environments;patient with children.",
	"grp":"sporting",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/golden-retriever-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/golden-retriever.jpg"
    },
    {
        "name": "Great Dane",
        "other_names": "German mastiff",
        "country_of_origin": "Germany",
        "desription": "The Great Dane is a large German breed of domestic dog known for its enormous body and great height.The Great Dane is one of the world's tallest dog breeds.Their large size belies their friendly nature, as Great Danes are known for seeking physical affection from their owners.",
        "temperament": "the breed is often referred to as a gentle giant; well disposed toward other dogs, other non-canine pets, and familiar humans.",
        "life_span": "8 years",
        "weight": "45-65 kg",
        "height": "70-110cm",
        "litter_size": "8-15",
        "remarks": "The Great Dane is a very gentle and loving animal and with the proper care and training is great around children",
	"grp":"working",
	"size":"large",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/greatdane-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/greatdane.jpg"
    },
    {
        "name": "Irish Setter",
        "other_names": "Irish Red Setter",
        "country_of_origin": "Ireland",
        "desription": "Irish Setters are deep chested dogs with small waists. The coat is moderately long, silky, and of a red or chestnut color. It requires frequent brushing to maintain its condition and keep it mat-free. The undercoat is abundant in winter weather, and the top coat is fine. Their coats should also feather in places such as the tail, ears, chest, legs, and body.",
        "temperament": "get along well with children, other dogs, and any household pets, and will enthusiastically greet visitors; Even though they do well with household pets, small animals may pose a problem for this breed, as they are a hunting breed",
        "life_span": "10-12 years",
        "weight": "25-34 kg",
        "height": "55-67 cm",
        "litter_size": "4-8",
        "remarks": "widely used as therapy dogs in schools and hospitals",
	"grp":"sporting",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/seter-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/seter.jpg"
    },
    {
        "name": "Labrador Retriever",
        "other_names": "Labrador, Lab",
        "country_of_origin": "Canada",
        "desription": "Labrador is one of several kinds of retrievers, a type of gun dog.Athletic, playful, and the most popular breed of dog in many countries.A favourite assistance dog breed Labradors are frequently trained to aid people who are blind and people with autism, act as therapy dogs, and perform screening and detection work for law enforcement and other official agencies.",
        "temperament": " kind, pleasant, outgoing and tractable nature",
        "life_span": "12",
        "weight": "25-35",
        "height": "55-62",
        "litter_size": "5-10",
        "remarks": "for runners and cyclists, home with garden",
	"grp":"sporting",
	"size":"medium",
	"thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/yellow-labrador-retriever-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/yellow-labrador-retriever.jpg"
    },
    {
        "name": "Poodle",
        "other_names": "Caniche",
        "country_of_origin": "France",
        "desription": "The poodle is a group of formal dog breeds, the Standard Poodle, Miniature Poodle and Toy Poodle.The breed is skillful in many dog sports, including agility, obedience, tracking, and even herding. Intelligent and elegant dog, squarely built, and well proportioned.The Poodle has a wide variety of coloring, including white, black, brown, parti, silver, gray, silver beige, apricot, red, cream, sable, and patterns such as phantom and brindle.In most cases, whether a poodle is in a pet or show clip, the hair is completely brushed out. Poodle hair can also be corded with rope-like mats similar to those of a Komondor or human dreadlocks. Though once as common as the curly poodle, corded poodles are now rare. Corded coats are difficult to keep clean and take a long time to dry after washing. Any poodle with a normal coat can be corded when its adult coat is in. ",
        "temperament": " highly intelligent, energetic, and sociable breed; require both physical and intellectual activities.",
        "life_span": "10-15 years",
        "weight": "4-20 kg",
        "height": "28-45 cm",
        "litter_size": "3-8",
        "remarks": "easy to train",
	"grp":"non-sporting",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/poodle-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/poodle.jpg"
    },
    {
        "name": "Pug",
        "other_names": "Mops, Carlin",
        "country_of_origin": "China",
        "desription": "The Pug is a breed of dog with a wrinkly, short-muzzled face and curled tail. The breed has a fine, glossy coat that comes in a variety of colours, most often fawn or black, and a compact square body with well-developed muscles.Pugs were brought from China to Europe in the sixteenth century and were popularized in Western Europe.Pugs have two distinct shapes for their ears, rose and button. Rose ears are smaller than the standard style of button ears, and are folded with the front edge against the side of the head. Breeding preference goes to button style ears.",
        "temperament": "strong willed but rarely aggressive, and suitable for families with children;depending on their owner's mood, they can be quiet and docile but also vivacious and teasing.",
        "life_span": "12-14 years",
        "weight": " 6.5-8 kg",
        "height": "25-35 cm",
        "litter_size": "4-8",
        "remarks": "easy to train,appropriate for apartments",
	"grp":"toy",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/mops-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/mops.jpg"
    },
    {
        "name": "Rottweiler",
        "other_names": "Rott, Rottie",
        "country_of_origin": "Germany",
        "desription": "The breed's history likely dates to the Roman Empire.It is likely that the Rottweiler is a descendant of ancient Roman drover dogs, a mastiff-type dog that was a dependable, rugged dog with great intelligence and guarding instincts.This breed is all about balance, endurance, proportionality, intelligence and strength.The skull is of medium length, broad between the ears.The Rottweiler nose is well developed, more broad than round, with relatively large nostrils and always black.The neck is strong, of fair length, well muscled.The back is straight, strong and firm. The loins are short, strong and deep.Rottweiler coats tend to be low maintenance, although they experience heavy shedding before their seasons (females) or seasonally (males).The color and markings of a Rottweiler are very distinctive. A Rottweiler is always, by any breed club standards, black with well-defined mahogany or rust-colored markings that do not take up more than ten percent of the dog's body color.",
        "temperament": "good-natured, placid in basic disposition, very devoted, obedient, biddable and eager to work; they react to their surroundings with great alertness.Due to exceptional strength, breed experts declare that formal training and extensive socialisation are essential.Potentially dangerous behaviour in Rottweilers usually results from irresponsible ownership, abuse, neglect,",
        "life_span": "8-10 years",
        "weight": "35-60 kg",
        "height": "55-69 cm",
        "litter_size": "8-12",
        "remarks": "tend to be more aggressive than average toward strangers.",
	"grp":"working",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/rottweiler-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/rottweiler.jpg"
    },
    {
        "name": "Rough Collie",
        "other_names": "Collie, English collie,lassie dog",
        "country_of_origin": "United Kingdom (Scotland)",
        "desription": "The Rough Collie is a long coated breed of medium to large size dog that in its original form was a type of collie used and bred for herding in Scotland.Three coat colours are recognised for Rough Collies: sable and white, where the sable ranges from pale tan to a mahogany; tricolour, which is primarily black edged in tan; blue merle, which is mottled gray. All have white coat areas, in the collar, parts of the leg, and usually the tail tip. Some may have white blazes on their faces.One of the characteristic features of the Rough Collie is its head. This is light in relation to the rest of the body, and resembles a blunted wedge tapering smoothly from ears to black nose, with a distinct stop and parallel head planes. The muzzle is well rounded, and never square. There is considerable variation in the colour of the head, however. The eyes are medium-sized and almond shaped.",
        "temperament": "very loyal and may be one-family dogs, but are very rarely aggressive or protective beyond barking and providing a visual deterrent. They are typically excellent with children as long as they have been well-socialised and trained.",
        "life_span": "12-15 years",
        "weight": "20-34 kg",
        "height": "52-66 cm",
        "litter_size": "5-6",
        "remarks": "active outside, calm indoors;",
	"grp":"herding",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/colie-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/collie.jpg"
    },
    {
        "name": "Saint-Bernard",
        "other_names": "Alpine Mastiff, Saint",
        "country_of_origin": "Switzerland",
        "desription": "St. Bernards are often portrayed wearing small barrels of brandy around their necks. Avalanche victims supposedly drank the brandy to stay warm while awaiting rescue, although this is medically unsound. The monks of the St. Bernard Hospice deny that any St. Bernard has ever carried casks or small barrels around their necks.The St. Bernard is a giant dog, with the largest individuals reaching over 140 kg.The rough coat is dense but flat, and more profuse around the neck and legs. The coat is typically a red color with white, or sometimes a mahogany brindle with white. Black shading is usually found on the face and ears. The tail is long and heavy, hanging low. Eyes should have naturally tight lids, they are usually brown, but sometimes can be icy blue.",
        "temperament": "Gentle Giant, the Saint Bernard is calm, patient and sweet with adults, and especially children.While generally not instinctively protective, a St. Bernard may bark at strangers, and their size makes them good deterrents against possible intruders ",
        "life_span": "8-10 years",
        "weight": "65–120 kg kg",
        "height": "70-90 cm",
        "litter_size": "2-10",
        "remarks": "rescue dog",
	"grp":"working",
	"size":"large",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/saint-bernard-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/saint-bernard.jpg"
    },
    {
        "name": "Samoyed",
        "other_names": "Bjelkier",
        "country_of_origin": "Russia",
        "desription": "The Samoyed is a breed of dog that takes its name from the Samoyedic peoples of Siberia.An alternate name for the breed, especially in Europe, is Bjelkier. Samoyeds have a dense, double layer coat. The topcoat contains long, coarse, and straight guard hairs, which appear white but have a hint of silver coloring. This top layer keeps the undercoat relatively clean and free of debris. The under layer, or undercoat, consists of a dense, soft, and short fur that keeps the dog warm. The undercoat typically sheds heavily once or twice a year, and this seasonal process is sometimes referred to as blowing coat. This does not mean the Samoyed will shed only during that time however; fine hairs (versus the dense clumps shed during seasonal shedding) will be shed all year round, and have a tendency to stick to cloth and float in the air. The standard Samoyed may come in a mixture of biscuit and white coloring, although pure white and all biscuit dogs are common.The Samoyed tail is one of the breeds more distinguishing features. The tail is carried curled over the back. In cold weather, Samoyeds may sleep with their tails over their noses to provide additional warmth. Almost all Samoyeds will allow their tails to fall when they are relaxed and at ease, as when being stroked or while eating, but will return their tails to a curl when more alert.",
        "temperament": "tendency to bark, however, they can be diligent watch dogs, barking whenever something approaches their territory; samoyeds are excellent companions, especially for small children or even other dogs, and they remain playful into old age.",
        "life_span": "12-15years",
        "weight": " 17-30 kg",
        "height": "45-60 cm",
        "litter_size": "4-6",
        "remarks": "Nicknamed Sammiesmile and smileydog due to  characteristic happy expression.",
	"grp":"working",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/samoyed-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/samoyed.jpg"
    },
    {
        "name": "Schnauzer",
        "other_names": "Snout",
        "country_of_origin": "Germany",
        "desription": "The schnauzer type consists of three breeds: the giant, standard, and miniature. The original schnauzer was of the same size as the modern Standard Schnauzer breed, and was bred as a rat catcher, yard dog, and guard dog. The Miniature Schnauzer is the result of crossing the original schnauzer with breeds including the poodle and the affenpinscher.Schnauzers have distinctive beards and long, feathery eyebrows. They are generally either a salt and pepper color, black, or white, but they can be brown also. Some owners shave their Schnauzers down the back while the hairs on their legs are kept long and curly, but this changes the coat colour, so show schnauzers especially will have their back coat stripped by hand, to encourage the salt and pepper pattern to emerge.Schnauzers are a type of dog that sheds less often than most dogs but is not hypoallergenic, as allergies are caused by dander. ",
        "temperament": "friendly and loving,can get along well with children if raised and socialized properly; protective and energetic, and will alert members of the household to any potential danger",
        "life_span": "12-16 years",
        "weight": "10-30 kg",
        "height": "30-70 cm",
        "litter_size": "3-6",
        "remarks": "easy ro train, home with garden",
	"grp":"working",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/schnauzer-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/schnauzer.jpg"
    },
    {
        "name": "Siberian Husky",
        "other_names": "Chukcha, Husky",
        "country_of_origin": "Russia",
        "desription": "Huskies are a very active, energetic, and resilient breed whose ancestors came from the extremely cold and harsh environment of the Siberian Arctic. Siberian Huskies were bred by the Chukchi of Northeastern Asia to pull heavy loads long distances through difficult conditions. The dogs were imported into Alaska during the Nome Gold Rush and later spread into the United States and Canada. They were initially sent to Alaska and Canada as sled dogs but rapidly acquired the status of family pets and show dogs.A Siberian Husky's coat is thicker than that of most other dog breeds,comprising two layers - a dense undercoat and a longer topcoat of short, straight guard hairs.It protects the dogs effectively against harsh Arctic winters, but the coat also reflects heat in the summer. It is able to withstand temperatures as low as −50 to −60 .The most common coats are black and white, then less common copper-red and white, grey and white, pure white, and the rare agouti coat, though many individuals have blondish or piebald spotting. Eyes may be brown or blue; one of each or particolored are acceptable - complete is heterochromia, and  half brown and half blue - partial heterochromia. Siberian Husky tails are heavily furred; these dogs will often curl up with their tails over faces and noses in order to provide additional warmth.",
        "temperament": " known to howl rather than bark; tendency to roam and to make escape attempts-they have been described as escape artists.",
        "life_span": "11-13 years",
        "weight": "16-27 kg",
        "height": "51-60 cm",
        "litter_size": "6-8",
        "remarks": "The Chukchi people use Siberian huskies to look after their children.",
	"grp":"working",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/siberianhusky-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/siberian-husky.jpg"
    },
    {
        "name": "Welsh Springer Spaniel",
        "other_names": "Welsh Cocker Spaniel",
        "country_of_origin": "Wales",
        "desription": "The Welsh Springer Spaniel is a compact, solidly built dog, bred for hard work and endurance. Their body can give the impression of length due to its obliquely angled forequarters and developed hindquarters.The breed's coat only comes in a single colour combination of white with red markings, usually in a piebald pattern. Loyal and affectionate, they can become very attached to family members and are wary of strangers. Health conditions are limited to those common among many breeds of dog, although they are affected more than average by hip dysplasia and some eye conditions. They are a working dog, bred for hunting, and while not as rare as some varieties of spaniel.",
        "temperament": " active, loyal, and affectionate breed; well known for being friendly and demonstrative to all members of the family, especially children, and accepting other pets of the household with a friendly, playful attitude.",
        "life_span": "12-15 years",
        "weight": "16-20 kg",
        "height": "43-48 cm",
        "litter_size": "1-4",
        "remarks": "for runners and cyclists",
	"grp":"sporting",
	"size":"medium",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/springer-spaniel-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/springer-spaniel.jpg"
    },
    {
        "name": "Westie",
        "other_names": "West Highland White Terrier, Westy",
        "country_of_origin": "Scotland",
        "desription": "It is a medium-sized terrier, although with longer legs than other Scottish breeds of terrier. It has a white double coat of fur which fills out the dog's face giving it a rounded appearance. The breed can be good with children, but will not always tolerate rough handling. The Westie is an active breed, but are social with a high prey drive, as they were once used to hunt rodents.",
        "temperament": " vary greatly, with some being friendly towards children whilst others prefer solitude; it will not tolerate rough handling such as a child pulling on its ears, and can be both food and toy possessive.",
        "life_span": "12-16 years",
        "weight": "6.5-9 kg",
        "height": "25-28 cm",
        "litter_size": "3-5",
        "remarks": "tends to be highly interested in toys especially chasing balls.",
	"grp":"terrier",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/westie-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/westie.jpg"
    },
    {
        "name": "Yorkshire Terrier",
        "other_names": "Yorkie",
        "country_of_origin": "England",
        "desription": "The Yorkshire Terrier is a small dog breed of terrier type, developed in the 19th century in the county of Yorkshire, England, to catch rats in clothing mills. The defining features of the breed are its maximum size of 3.2 kg, but some Yorkies may exceed and grow to be up to 7 kg.Traditionally the coat is grown out very long and is parted down the middle of the back.From the back of the neck to the base of the tail, the coat should be a dark gray to a black colour, and the hair on the tail should be a darker black. On the head, high chest, and legs, the hair should be a bright, rich tan, darker at the roots than in the middle, that shades into a lighter tan at the tips, but not for all dogs. Also, in adult dogs there should be no black hairs intermingled with any of the tan coloured fur.It may take three or more years for the coat to reach its final colour. The final colour is usually a black grayish colour",
        "temperament": " active, very overprotective, curious, loves attention; tend to bark a lot.",
        "life_span": "13-16 years",
        "weight": "3.2-7 kg",
        "height": "22-24 cm",
        "litter_size": "1-5",
        "remarks": "not be suitable for a home with young children, perfect for older families.",
	"grp":"toy",
	"size":"small",
        "thumbnail": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_thumbnails/yorkshire-terrier-th.jpg",
        "image": "https://raw.githubusercontent.com/SebastianGK/BreedTest/master/breed_images/yorkshire-terrier.jpg"
    }
]
